Revit 2026 API

# ViewScheduleHasStripedRows Property

---

Indicates whether this schedule has striped rows.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasStripedRows { get; set; }
```
```vb
Public Property HasStripedRows As Boolean
	Get
	Set
```
```cpp
public:
property bool HasStripedRows {
	bool get ();
	void set (bool value);
}
```
```fsharp
member HasStripedRows : bool with get, set
```

#### Property Value

Boolean

Striped rows can be overridden by shading or conditional formatting.

#### Reference

ViewSchedule Class

Autodesk.Revit.DB Namespace